app/views/finances/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
    f.column name: 'Name', attribute: 'fullname', model: 'User' do |fin|
      User.find(fin.user_id).fullname

SELECT "finances".* FROM "finances"
---
    end
    f.column name: 'Date', attribute: 'date', model: 'Finance', filter: false do |fin|