app/controllers/finances_controller.rb

  def index
    if user_signed_in?
      if current_admin_user
        @finances_grid = initialize_grid(Finance,
          :include => [:user])
        @total_cash = Finance.sum("cash_amount")
        @total_check = Finance.sum("check_amount")
        @total_amount = @total_cash + @total_check

      else
        @finances_grid = initialize_grid(Finance,
          :include => [:user],
          :conditions => "user_id = #{current_user.id}" )
        @total_cash = current_user.finances.sum("cash_amount")
---
SELECT "finances".* FROM "finances"
SELECT "finances".* FROM "finances" WHERE "finances"."user_id" = 1

  def show
    if current_admin_user
      @finance = Finance.find(params[:id])
    else
      @finance = current_user.finances.find(params[:id])
---
SELECT "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "finances".* FROM "finances" WHERE "finances"."user_id" = 2 AND "finances"."id" = ? LIMIT 1  [["id", "2"]]

  def edit
    if current_admin_user
    @finance = Finance.find(params[:id])
---
SELECT "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    if current_admin_user
      #@finance = Finance.new(params[:finance])
      @finance = User.find(params[:finance][:user_id]).finances.new(params[:finance])

      respond_to do |format|
        if @finance.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "finances" ("audit", "cash_amount", "check_amount", "check_number", "created_at", "data_entry", "date", "input_id", "notes", "supporter_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if current_admin_user
      @finance = Finance.find(params[:id])

      respond_to do |format|
        if @finance.update_attributes(params[:finance])
---
SELECT "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "finances" SET "supporter_name" = 'Tim', "cash_amount" = 14.15, "check_amount" = 60.0, "check_number" = 13, "notes" = 'Hello', "data_entry" = 'Guy1', "audit" = 'Guy2', "updated_at" = '2013-04-08 00:23:19.166194' WHERE "finances"."id" = 2

  def destroy
    if current_admin_user
      @finance = Finance.find(params[:id])
      @finance.destroy
---
SELECT "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "finances" WHERE "finances"."id" = ?  [["id", 1]]